Revit 2026 API

# PerformanceAdviserRuleId Properties

---

The PerformanceAdviserRuleId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. (Inherited from GuidEnum) |

#### Reference

PerformanceAdviserRuleId Class

Autodesk.Revit.DB Namespace